brew "git"

brew "bash-completion"
brew "anyenv"

tap "github/gh"
brew "github/gh/gh"

# window manager
tap "koekeishiya/homebrew-formulae"
brew "koekeishiya/homebrew-formulae/skhd"
brew "koekeishiya/homebrew-formulae/yabai"

brew "tmux"
brew "vim"
brew "fzf"
brew "wget"
brew "curl"
brew "ag"
brew "watch"
brew "jq"
brew "tldr"

brew "openssl"

cask "docker"
cask "postgres"
cask "iterm2"
cask "slack"
cask "spotify"
cask "firefox"
cask "dashlane"
cask "java"
cask "visual-studio-code"

