brew "git"

brew "bash-completion"
brew "anyenv"

tap "github/gh"
brew "github/gh/gh"

# window manager
tap "koekeishiya/homebrew-formulae"
brew "koekeishiya/homebrew-formulae/skhd"
brew "koekeishiya/homebrew-formulae/yabai"
cask "ubersicht"
cask "sf-symbols"

# misc
brew "tmux"
brew "vim"
brew "fzf"
brew "wget"
brew "htop"
brew "curl"
brew "ag"
brew "watch"
brew "jq"
brew "tldr"
brew "openssl"
brew "zsh-completions"

# dev dependencies
brew "poppler" # used for pdftotext in mario
brew "postgresql"
brew "redis"

# pg gem dependencies
brew "libpq"

# GUI programs
cask "slack"
cask "spotify"
cask "firefox"
cask "dashlane"
cask "skitch"

# development gui stuff
cask "visual-studio-code"
cask "java"
cask "docker"
cask "postgres"
cask "iterm2"
cask "tableplus"
cask "cyberduck"
cask "oxygen-xml-editor"

# java shit
tap "AdoptOpenJDK/openjdk"
cask "adoptopenjdk8"
cask "adoptopenjdk11"
