brew "git"

brew "bash-completion"
brew "anyenv"

tap "github/gh"
brew "gh"

# window manager
tap "koekeishiya/homebrew-formulae"
brew "koekeishiya/homebrew-formulae/skhd"
brew "koekeishiya/homebrew-formulae/yabai"
cask "whichspace"

# misc
brew "tmux"
brew "vim"
brew "fzf"
brew "wget"
brew "htop"
brew "curl"
brew "ag"
brew "watch"
brew "jq"
brew "tldr"
brew "openssl"
brew "zsh-completions"

# dev dependencies
brew "poppler" # used for pdftotext in mario
brew "postgresql"
brew "redis"
brew "imagemagick@6", link: true, conflicts_with: ["imagemagick"]
tap "InstantClientTap/instantclient"
brew "instantclient-sdk"
brew "instantclient-basic"

# pg gem dependencies
brew "libpq"

# GUI programs
cask "spotify"
cask "firefox"
cask "dashlane"
cask "skitch"
cask "google-chrome"

# communications
cask "slack"
cask "microsoft-teams"
cask "zoomus"

# development gui stuff
cask "visual-studio-code"
cask "java"
cask "docker"
cask "postgres"
cask "iterm2"
cask "tableplus"
cask "cyberduck"
cask "oxygen-xml-editor"
cask "keybase"
cask "gitkraken" # maybe remove?
cask "postman"

# cloudstuff
cask "google-cloud-sdk"
brew "kubectl"
brew "k9s"

# java shit
tap "AdoptOpenJDK/openjdk"
cask "adoptopenjdk8"
cask "adoptopenjdk11"
